"""
Задача 1.

Розробіть програму для виведення інформації про
операційну систему, яка встановлена на комп’ютері
користувачa, при введенні відповідного номера: 1 -
Window, 2 - Linux, 3 - MacOS. Передбачте у роботі
програми ситуації, коли користувач вводить інший номер,
відмінний від наведених, або програма
на вхід отримує порожній рядок.

Автор: Новосад Сніжана

"""

input_value = input("Введіть номер операційної системи (1 - Windows, 2 - MacOS, 3 - Linux): ")

if input_value == '1':
    print("Windows")
elif input_value == '2':
    print("MacOS")
elif input_value == '3':
    print("Linux")
elif not input_value:
    print("Введено порожній рядок.")
else:
    print("Введено невірний номер операційної системи.")
